# Exercise 02 -  OLAP Cubes - Grouping Sets

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

Start by connecting to the database by running the cells below. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed the slicing and dicing exercise, then skip to the second cell.

In [ ]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-star.sql

### Connect to the local database where Pagila is loaded

In [11]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila_star'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila_star

'Connected: student@pagila_star'

### Star Schema

<img src="pagila-star.png" width="50%"/>

# Grouping Sets
- It happens often that for 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a more clever way to do that using the SQL grouping statement "GROUPING SETS"

## Total Revenue

TODO: Write a query that calculates total revenue (sales_amount)

In [12]:
%%sql
SELECT sum(sales_amount) as total_revenue
FROM factSales;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
1 rows affected.

[(Decimal('337082.55'),)]

In [2]:
%%sql
SELECT ...
FROM ...

 * postgresql://student:***@127.0.0.1:5432/pagila_star
1 rows affected.

[(Decimal('337082.55'),)]

## Revenue by Country
TODO: Write a query that calculates total revenue (sales_amount) by country

In [19]:
%%sql
SELECT country, sum(sales_amount) as total_revenue
FROM factSales f
join dimstore ds on f.store_key = ds.store_key
group by 1
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
2 rows affected.

[('Australia', Decimal('168633.85')), ('Canada', Decimal('168448.70'))]

In [ ]:
%%sql
SELECT ...
FROM ...

## Revenue by Month
TODO: Write a query that calculates total revenue (sales_amount) by month

In [20]:
%%sql
SELECT month, sum(sales_amount) as total_revenue
FROM factSales f
join dimdate dd on f.date_key = dd.date_key
group by 1
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.

[(1, Decimal('24122.15')),
 (3, Decimal('119432.80')),
 (4, Decimal('142797.30')),
 (2, Decimal('48159.40')),
 (5, Decimal('2570.90'))]

In [ ]:
%%sql
SELECT ...
FROM ...

## Revenue by Month & Country
TODO: Write a query that calculates total revenue (sales_amount) by month and country. Sort the data by month, country, and revenue in descending order. The first few rows of your output should match the table below.

In [22]:
%%sql
SELECT month, country, sum(sales_amount) as total_revenue
FROM factSales f
join dimdate dd on f.date_key = dd.date_key
join dimstore ds on f.store_key = ds.store_key
group by 1,2
order by 1,2,3 desc
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.

[(1, 'Australia', Decimal('11820.95')),
 (1, 'Canada', Decimal('12301.20')),
 (2, 'Australia', Decimal('24475.50')),
 (2, 'Canada', Decimal('23683.90')),
 (3, 'Australia', Decimal('60301.65'))]

In [ ]:
%%sql
SELECT ...
FROM ...

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>month</th>
        <th>country</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>1</td>
        <td>Australia</td>
        <td>2364.19</td>
    </tr>
    <tr>
        <td>1</td>
        <td>Canada</td>
        <td>2460.24</td>
    </tr>
    <tr>
        <td>2</td>
        <td>Australia</td>
        <td>4895.10</td>
    </tr>
    <tr>
        <td>2</td>
        <td>Canada</td>
        <td>4736.78</td>
    </tr>
    <tr>
        <td>3</td>
        <td>Australia</td>
        <td>12060.33</td>
    </tr>
</tbody></table></div>

## Revenue Total, by Month, by Country, by Month & Country All in one shot

TODO: Write a query that calculates total revenue at the various grouping levels done above (total, by month, by country, by month & country) all at once using the grouping sets function. Your output should match the table below.

In [25]:
%%sql
SELECT month, country, sum(sales_amount) as total_revenue
FROM factSales f
join dimdate dd on f.date_key = dd.date_key
join dimstore ds on f.store_key = ds.store_key
group by cube(1,2)
order by 1,2,3 desc;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
18 rows affected.

[(1, 'Australia', Decimal('11820.95')),
 (1, 'Canada', Decimal('12301.20')),
 (1, None, Decimal('24122.15')),
 (2, 'Australia', Decimal('24475.50')),
 (2, 'Canada', Decimal('23683.90')),
 (2, None, Decimal('48159.40')),
 (3, 'Australia', Decimal('60301.65')),
 (3, 'Canada', Decimal('59131.15')),
 (3, None, Decimal('119432.80')),
 (4, 'Australia', Decimal('70680.35')),
 (4, 'Canada', Decimal('72116.95')),
 (4, None, Decimal('142797.30')),
 (5, 'Australia', Decimal('1355.40')),
 (5, 'Canada', Decimal('1215.50')),
 (5, None, Decimal('2570.90')),
 (None, 'Australia', Decimal('168633.85')),
 (None, 'Canada', Decimal('168448.70')),
 (None, None, Decimal('337082.55'))]

In [ ]:
%%sql
SELECT ...
FROM ...

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>month</th>
        <th>country</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>1</td>
        <td>Australia</td>
        <td>2364.19</td>
    </tr>
    <tr>
        <td>1</td>
        <td>Canada</td>
        <td>2460.24</td>
    </tr>
    <tr>
        <td>1</td>
        <td>None</td>
        <td>4824.43</td>
    </tr>
    <tr>
        <td>2</td>
        <td>Australia</td>
        <td>4895.10</td>
    </tr>
    <tr>
        <td>2</td>
        <td>Canada</td>
        <td>4736.78</td>
    </tr>
    <tr>
        <td>2</td>
        <td>None</td>
        <td>9631.88</td>
    </tr>
    <tr>
        <td>3</td>
        <td>Australia</td>
        <td>12060.33</td>
    </tr>
    <tr>
        <td>3</td>
        <td>Canada</td>
        <td>11826.23</td>
    </tr>
    <tr>
        <td>3</td>
        <td>None</td>
        <td>23886.56</td>
    </tr>
    <tr>
        <td>4</td>
        <td>Australia</td>
        <td>14136.07</td>
    </tr>
    <tr>
        <td>4</td>
        <td>Canada</td>
        <td>14423.39</td>
    </tr>
    <tr>
        <td>4</td>
        <td>None</td>
        <td>28559.46</td>
    </tr>
    <tr>
        <td>5</td>
        <td>Australia</td>
        <td>271.08</td>
    </tr>
    <tr>
        <td>5</td>
        <td>Canada</td>
        <td>243.10</td>
    </tr>
    <tr>
        <td>5</td>
        <td>None</td>
        <td>514.18</td>
    </tr>
    <tr>
        <td>None</td>
        <td>None</td>
        <td>67416.51</td>
    </tr>
    <tr>
        <td>None</td>
        <td>Australia</td>
        <td>33726.77</td>
    </tr>
    <tr>
        <td>None</td>
        <td>Canada</td>
        <td>33689.74</td>
    </tr>
</tbody></table></div>